export interface DtpFabula {
  article: string;
  point: string;
  name: string;
  fabula: string;
}

export const DTP_FABULY: DtpFabula[] = [
  {
    article: '—',
    point: '—',
    name: 'Противоречие',
    fabula:
      'Между транспортным средством +++++ с регистрационными знаками +++++, под управлением +++++ и транспортным средством +++++ с регистрационными знаками +++++, под управлением +++++, произошло столкновение. Ввиду противоречивости показаний участников дорожно-транспортного происшествия, вынесено решение +++++++++ — об отказе в возбуждении дела об административном правонарушении / о возбуждении дела об административном правонарушении.',
  },
  {
    article: 'ст. 24.5',
    point: '—',
    name: 'Выброс гравия',
    fabula:
      'Из под колес неустановленного транспортного средства произошел выброс гравия, в результате чего транспортное средство +++++ с регистрационными знаками +++++, под управлением водителя +++++, получило механические повреждения.',
  },
  {
    article: 'ст. 12.27 ч. 2',
    point: '—',
    name: 'Уезд с места ДТП',
    fabula:
      'Неустановленный водитель, управляя неустановленным транспортным средством, совершил столкновение с транспортным средством +++++ с регистрационными знаками +++++, под управлением +++++, после чего с места дорожно-транспортного происшествия скрылся.',
  },
  {
    article: 'ст. 24.5',
    point: 'п. 1.5',
    name: 'Не справился с управлением',
    fabula:
      'Водитель +++++ управляя транспортным средством +++++ с регистрационными знаками +++++, не справился с управлением, в результате чего допустил столкновение с транспортным средством +++++ с регистрационными знаками +++++, под управлением +++++.',
  },
  {
    article: 'ст. 24.5',
    point: 'п. 1.5',
    name: 'Не убедился в безопасности маневра',
    fabula:
      'Водитель +++++ управляя транспортным средством +++++ с регистрационными знаками +++++, не убедился в безопасности своего маневра, в результате чего допустил столкновение с транспортным средством +++++ с регистрационными знаками +++++, под управлением +++++.',
  },
  {
    article: 'ст. 24.5',
    point: 'п. 1.5',
    name: 'Опрокидывание',
    fabula:
      'Водитель +++++ управляя транспортным средством +++++ с регистрационными знаками +++++, не справившись с управлением допустил занос своего транспортного средства с последующим опрокидыванием.',
  },
  {
    article: 'ст. 24.5',
    point: 'п. 1.5',
    name: 'Выезд в кювет',
    fabula:
      'Водитель +++++ управляя транспортным средством +++++ с регистрационными знаками +++++, не справившись с управлением допустил занос своего транспортного средства с последующим выездом в кювет.',
  },
  {
    article: 'ст. 24.5',
    point: 'п. 1.5',
    name: 'Встречка — не справился с управлением',
    fabula:
      'Водитель +++++ управляя транспортным средством +++++ с регистрационными знаками +++++, не справился с управлением, в результате чего допустил выезд на полосу, предназначенную для встречного движения, где допустил столкновение со встречным транспортным средством +++++ с регистрационными знаками +++++, под управлением +++++.',
  },
  {
    article: 'ст. 12.17 ч. 1',
    point: 'п. 3.2',
    name: 'Спец ТС с синим маячком',
    fabula:
      'Водитель +++++ управляя транспортным средством +++++ с регистрационными знаками +++++, не предоставил преимущества в движении транспортному средству +++++ с регистрационными знаками +++++, под управлением +++++, с одновременно включенными проблесковым маячком синего цвета и специальным звуковым сигналом.',
  },
  {
    article: 'ст. 12.17 ч. 2',
    point: 'п. 3.2',
    name: 'Спец ТС с цветографическими схемами',
    fabula:
      'Водитель +++++ управляя транспортным средством +++++ с регистрационными знаками +++++, не предоставил преимущества в движении транспортному средству +++++ с регистрационными знаками +++++, под управлением +++++, имеющему нанесенные на наружные поверхности специальные цветографические схемы, надписи и обозначения, с одновременно включенными проблесковым маячком синего цвета и специальным звуковым сигналом.',
  },
  {
    article: 'ст. 12.12 ч. 1',
    point: 'п. 6.13',
    name: 'Проезд на запрещающий сигнал',
    fabula:
      'Водитель +++++ управляя транспортным средством +++++ с регистрационными знаками +++++, проехал на запрещающий сигнал светофора, в результате чего допустил столкновение с транспортным средством +++++ с регистрационными знаками +++++, под управлением +++++.',
  },
  {
    article: 'ст. 12.14 ч. 3',
    point: 'п. 8.1',
    name: 'Начало движения',
    fabula:
      'Водитель +++++ управляя транспортным средством +++++ с регистрационными знаками +++++, перед началом движения, не уступил дорогу транспортному средству +++++ с регистрационными знаками +++++, под управлением +++++.',
  },
  {
    article: 'ст. 12.14 ч. 3',
    point: 'п. 8.3',
    name: 'Выезд с прилегающей',
    fabula:
      'Водитель +++++ управляя транспортным средством +++++ с регистрационными знаками +++++, при выезде на дорогу с прилегающей территории не уступил дорогу имеющему преимущество в движении транспортному средству +++++ с регистрационными знаками +++++, под управлением +++++.',
  },
  {
    article: 'ст. 12.14 ч. 3',
    point: 'п. 8.4',
    name: 'Перестроение',
    fabula:
      'Водитель +++++ управляя транспортным средством +++++ с регистрационными знаками +++++, при перестроении не уступил дорогу транспортному средству +++++ с регистрационными знаками +++++, под управлением +++++, движущемуся попутно без изменения направления движения.',
  },
  {
    article: 'ст. 12.14 ч. 1.1',
    point: 'п. 8.5',
    name: 'Не занял соответствующее крайнее положение',
    fabula:
      'Водитель +++++ управляя транспортным средством +++++ с регистрационными знаками +++++, перед выполнением маневра (поворот направо, налево, разворота) не занял соответствующее крайнее положение на проезжей части, предназначенной для движения в данном направлении, в результате чего допустил столкновение с транспортным средством +++++ с регистрационными знаками +++++, под управлением +++++.',
  },
  {
    article: 'ст. 12.15 ч. 4',
    point: 'п. 8.6',
    name: 'При выезде с перекрестка оказался на встречке',
    fabula:
      'Водитель +++++ управляя транспортным средством +++++ с регистрационными знаками +++++, выполняя маневр поворота (налево, направо) при выезде с пересечения проезжих частей оказался на стороне встречного движения, где допустил столкновение со встречным транспортным средством +++++ с регистрационными знаками +++++, под управлением +++++.',
  },
  {
    article: 'ст. 12.14 ч. 3',
    point: 'п. 8.8',
    name: 'Маневр вне перекрестка',
    fabula:
      'Водитель +++++ управляя транспортным средством +++++ с регистрационными знаками +++++, при выполнении маневра (поворота налево, разворота) вне перекрестка не уступил дорогу встречному транспортному средству +++++ с регистрационными знаками +++++, под управлением +++++.',
  },
  {
    article: 'ст. 12.14 ч. 3',
    point: 'п. 8.9',
    name: 'Помеха справа',
    fabula:
      'Водитель +++++ управляя транспортным средством +++++ с регистрационными знаками +++++, при пересечении проезжей части, на которой очередность проезда не оговорена, не уступил дорогу движущемуся справа транспортному средству +++++ с регистрационными знаками +++++, под управлением +++++.',
  },
  {
    article: 'ст. 24.5',
    point: 'п. 8.12',
    name: 'Движение задним ходом',
    fabula:
      'Водитель +++++ управляя транспортным средством +++++ с регистрационными знаками +++++, при движении задним ходом не убедился в безопасности своего маневра, не прибегнул к помощи других лиц, в результате чего допустил столкновение с транспортным средством +++++ с регистрационными знаками +++++, под управлением +++++.',
  },
  {
    article: 'ст. 12.14 ч. 2',
    point: 'п. 8.12',
    name: 'Движение задним ходом в запрещенных местах',
    fabula:
      'Водитель +++++ управляя транспортным средством +++++ с регистрационными знаками +++++, осуществил движение задним ходом в месте, где такие маневры запрещены (на пешеходном переходе; в тоннеле; на мосту, путепроводе, эстакаде и под ними; на железнодорожном переезде; в месте с видимостью дороги менее 100 м; в месте остановки маршрутных транспортных средств), в результате чего допустил столкновение с транспортным средством +++++ с регистрационными знаками +++++, под управлением +++++.',
  },
  {
    article: 'ст. 12.15 ч. 1',
    point: 'п. 9.1',
    name: 'Расположение ТС на проезжей части',
    fabula:
      'Водитель +++++ управляя транспортным средством +++++ с регистрационными знаками +++++, нарушил правила расположения транспортного средства на проезжей части, в результате чего допустил столкновение с транспортным средством +++++ с регистрационными знаками +++++, под управлением +++++.',
  },
  {
    article: 'ст. 12.15 ч. 1',
    point: 'п. 9.10',
    name: 'Дистанция',
    fabula:
      'Водитель +++++ управляя транспортным средством +++++ с регистрационными знаками +++++, нарушил правила расположения транспортного средства на проезжей части, не правильно выбрал дистанцию до впереди движущегося транспортного средства +++++ с регистрационными знаками +++++, под управлением +++++.',
  },
  {
    article: 'ст. 12.15 ч. 1',
    point: 'п. 9.10',
    name: 'Боковой интервал',
    fabula:
      'Водитель +++++ управляя транспортным средством +++++ с регистрационными знаками +++++, нарушил правила расположения транспортного средства на проезжей части, не правильно выбрал боковой интервал от транспортного средства +++++ с регистрационными знаками +++++, под управлением +++++.',
  },
  {
    article: 'ст. 12.15 ч. 1',
    point: 'п. 9.10',
    name: 'Боковой интервал — наезд на препятствие',
    fabula:
      'Водитель +++++ управляя транспортным средством +++++ с регистрационными знаками +++++, нарушил правила расположения транспортного средства на проезжей части, не правильно выбрал боковой интервал, в результате чего допустил наезд на препятствие.',
  },
  {
    article: 'ст. 24.5',
    point: 'п. 10.1',
    name: 'Скорость — столкновение',
    fabula:
      'Водитель +++++ управляя транспортным средством +++++ с регистрационными знаками +++++, не правильно выбрал скорость для движения обеспечивающий постоянный контроль за движением транспортного средства, в результате чего не смог снизить скорость вплоть до остановки транспортного средства и допустил столкновение с транспортным средством +++++ с регистрационными знаками +++++, под управлением +++++.',
  },
  {
    article: 'ст. 24.5',
    point: 'п. 10.1',
    name: 'Встречка — скорость',
    fabula:
      'Водитель +++++ управляя транспортным средством +++++ с регистрационными знаками +++++, не правильно выбрал скорость для движения обеспечивающий постоянный контроль за движением транспортного средства, в результате чего не справился с управлением, и допустил выезд на полосу, предназначенную для встречного движения, где допустил столкновение со встречным транспортным средством +++++ с регистрационными знаками +++++, под управлением +++++.',
  },
  {
    article: 'ст. 24.5',
    point: 'п. 10.1',
    name: 'Скорость — опрокидывание',
    fabula:
      'Водитель +++++ управляя транспортным средством +++++ с регистрационными знаками +++++, не правильно выбрал скорость для движения обеспечивающий постоянный контроль за движением транспортного средства, в результате чего не справился с управлением и допустил занос своего транспортного средства с последующим опрокидыванием.',
  },
  {
    article: 'ст. 24.5',
    point: 'п. 10.1',
    name: 'Скорость — съезд в кювет',
    fabula:
      'Водитель +++++ управляя транспортным средством +++++ с регистрационными знаками +++++, не правильно выбрал скорость для движения обеспечивающий постоянный контроль за движением транспортного средства, в результате чего не справившись с управлением допустил занос своего транспортного средства с последующим выездом в кювет.',
  },
  {
    article: 'ст. 12.15 ч. 4',
    point: 'п. 11',
    name: 'Встречка',
    fabula:
      'Водитель +++++ управляя транспортным средством +++++ с регистрационными знаками +++++, в нарушение Правил дорожного движения выехал на полосу, предназначенную для встречного движения, где допустил столкновение со встречным транспортным средством +++++ с регистрационными знаками +++++, под управлением +++++.',
  },
  {
    article: 'ст. 12.19 ч. 1',
    point: 'п. 12.8',
    name: 'Самопроизвольное движение',
    fabula:
      'Водитель +++++ управляя транспортным средством +++++ с регистрационными знаками +++++, после остановки покинул транспортное средство, не приняв необходимых мер, исключающее самопроизвольное движение, в результате чего транспортное средство начало движение и совершило наезд на транспортное средство +++++ с регистрационными знаками +++++, под управлением +++++.',
  },
  {
    article: 'ст. 12.18',
    point: 'п. 13.1',
    name: 'Не уступил пешеходу — поворот на нерегулируемом перекрестке',
    fabula:
      'Водитель +++++ управляя транспортным средством +++++ с регистрационными знаками +++++, при повороте на нерегулируемом перекрестке (направо, налево), не уступил дорогу пешеходу +++++, пересекающему проезжую часть дороги (слева направо, справа налево) по ходу движения транспортного средства.',
  },
  {
    article: 'ст. 12.18',
    point: 'п. 13.1',
    name: 'Не уступил пешеходу — поворот на регулируемом перекрестке',
    fabula:
      'Водитель +++++ управляя транспортным средством +++++ с регистрационными знаками +++++, при повороте на регулируемом перекрестке (направо, налево), не уступил дорогу пешеходу +++++, пересекающему проезжую часть дороги на разрешающий сигнал светофора (слева направо, справа налево) по ходу движения транспортного средства.',
  },
  {
    article: 'ст. 12.13 ч. 2',
    point: 'п. 13.4',
    name: 'Поворот (разворот) по зеленому сигналу',
    fabula:
      'Водитель +++++ управляя транспортным средством +++++ с регистрационными знаками +++++, при повороте налево (развороте) по зеленому сигналу светофора не уступил дорогу транспортному средству +++++ с регистрационными знаками +++++, под управлением +++++.',
  },
  {
    article: 'ст. 12.13 ч. 2',
    point: 'п. 13.5',
    name: 'Движение в направлении стрелки',
    fabula:
      'Водитель +++++ управляя транспортным средством +++++ с регистрационными знаками +++++, при движении в направлении стрелки, включенной в дополнительной секции одновременно с желтым или красным сигналом светофора не уступил дорогу транспортному средству +++++ с регистрационными знаками +++++, под управлением +++++, движущемуся с другого направления.',
  },
  {
    article: 'ст. 12.13 ч. 2',
    point: 'п. 13.8',
    name: 'Завершение движения через перекресток',
    fabula:
      'Водитель +++++ управляя транспортным средством +++++ с регистрационными знаками +++++, при включении разрешающего сигнала светофора не уступил дорогу завершающему движение через перекресток транспортному средству +++++ с регистрационными знаками +++++, под управлением +++++.',
  },
  {
    article: 'ст. 12.13 ч. 2',
    point: 'п. 13.9',
    name: 'Перекресток неравнозначных дорог',
    fabula:
      'На перекрестке неравнозначных дорог водитель +++++ транспортного средства +++++ с регистрационными знаками +++++, движущийся по второстепенной дороге, не уступил дорогу транспортному средству +++++ с регистрационными знаками +++++, под управлением +++++, движущемуся по главной дороге.',
  },
  {
    article: 'ст. 12.13 ч. 2',
    point: 'п. 13.11',
    name: 'Перекресток равнозначных дорог',
    fabula:
      'На перекрестке равнозначных дорог водитель +++++ управляя транспортным средством +++++ с регистрационными знаками +++++, не уступил дорогу транспортному средству +++++ с регистрационными знаками +++++, под управлением +++++, движущемуся справа.',
  },
  {
    article: 'ст. 12.13 ч. 2',
    point: 'п. 13.11(1)',
    name: 'Круговое движение',
    fabula:
      'Водитель +++++ управляя транспортным средством +++++ с регистрационными знаками +++++, при въезде на перекресток, на котором организовано круговое движение и обозначенным дорожным знаком 4.3, не уступил дорогу транспортному средству +++++ с регистрационными знаками +++++, под управлением +++++, движущемуся по такому перекрестку.',
  },
  {
    article: 'ст. 12.13 ч. 2',
    point: 'п. 13.12',
    name: 'Равнозначная дорога со встречного направления',
    fabula:
      'При повороте налево (развороте) водитель +++++ управляя транспортным средством +++++ с регистрационными знаками +++++, не уступил дорогу транспортному средству +++++ с регистрационными знаками +++++, под управлением +++++, движущемуся по равнозначной дороге со встречного направления прямо (направо).',
  },
  {
    article: 'ст. 12.18',
    point: 'п. 14.1',
    name: 'Не уступил пешеходу на нерегулируемом пешеходном переходе',
    fabula:
      'Водитель +++++ управляя транспортным средством +++++ с регистрационными знаками +++++, не уступил дорогу пешеходу +++++++, вступившему на проезжую часть и приступившему к ее переходу (слева направо, справа налево) по ходу движения транспортного средства по нерегулируемому пешеходному переходу, обозначенному дорожными знаками 5.19.1 и 5.19.2.',
  },
  {
    article: 'ст. 12.10 ч. 1',
    point: 'п. 15.3',
    name: 'Проезд через ЖД пути',
    fabula:
      'Водитель +++++ управляя транспортным средством +++++ с регистрационными знаками +++++, нарушил правила движения через железнодорожные пути а именно, +++++++++++++++, в результате чего произошло столкновение с локомотивом ++++++, под управлением машиниста +++++ (проехал железнодорожный переезд на запрещающий сигнал светофора; при закрытом или начинающем закрываться шлагбауме; при запрещающем сигнале дежурного по переезду — дежурный обращен к водителю грудью или спиной с поднятым над головой жезлом, красным фонарем или флажком, либо с вытянутыми в сторону руками).',
  },
  {
    article: 'ст. 12.17 ч. 1',
    point: 'п. 18.3',
    name: 'Маршрутное ТС отъезжает от остановки',
    fabula:
      'Водитель +++++ управляя транспортным средством +++++ с регистрационными знаками +++++, не предоставил преимущества в движении маршрутному транспортному средству +++++ с регистрационными знаками +++++, под управлением +++++, начинающему движение от обозначенного места остановки.',
  },
  {
    article: 'ст. 12.29 ч. 2',
    point: 'п. 24.1',
    name: 'Велосипедист на тротуаре наехал на пешехода',
    fabula:
      'Водитель +++++ управляя велосипедом +++++, двигаясь по тротуару в нарушение Правил дорожного движения, не справился с управлением и допустил наезд на пешехода ++++++, движущегося по тротуару.',
  },
  {
    article: 'ст. 12.29 ч. 2',
    point: 'п. 24.8',
    name: 'Велосипедист пересек пешеходный переход',
    fabula:
      'Водитель +++++ управляя транспортным средством +++++ с регистрационными знаками +++++, допустил наезд на велосипедиста ++++++, пересекающего проезжую часть дороги по нерегулируемому пешеходному переходу, обозначенным дорожными знаками 5.19.1 и 5.19.2, в нарушение требований Правил дорожного движения.',
  },
];
